yii/frontend/controllers/AsuranceController.php

    protected function getCountryName($countryCode)
    {
        $country = Countries::findOne(['code' => $countryCode]);
---
SELECT * FROM `countries` WHERE `code`='AL'