yii/frontend/controllers/AsuranceController.php

SELECT `plans`.* FROM `plans` LEFT JOIN `pricing` ON `plans`.`id` = `pricing`.`plan_id` WHERE (`plans`.`insurance_id`='1') AND (`pricing`.`duration`='7') AND ((`pricing`.`passenger`='adult') OR (`pricing`.`passenger` IS NULL) OR ((`pricing`.`passenger`='adult') AND (`pricing`.`passenger` IS NULL)))
---
        }

        // dd( $childrenPassenger );
        $plans = Plans::find()
            ->joinWith('pricings')
            ->where(['plans.insurance_id' => $model->type])
            ->andWhere(['pricing.duration' => $model->duration])
            ->andWhere([
                'or',
                ['pricing.passenger' => $adultPassenger],
                ['pricing.passenger' => $childrenPassenger],
                [
                    'and',
                    ['pricing.passenger' => $adultPassenger],
                    ['pricing.passenger' => $childrenPassenger]
                ]
            ])
            ->all();

SELECT * FROM `insurance_countries` WHERE (`insurance_id`='1') AND (UPPER(country_code)='AL')
---
        // dd($model->from_country);
        $CountryCode = strtoupper($model->from_country);
        // dd($CountryCode);
        $insuranceCountry = InsuranceCountries::find()
            ->where(['insurance_id' => $model->type])
            ->andWhere(['UPPER(country_code)' => $CountryCode])
            ->one();

SELECT * FROM `pricing` WHERE (`plan_id`=1) AND (`duration`='7')
---
        foreach ($plans as $plan) {
            $insuranceTitle = $plan->insurance->name;
            // dd($insuranceTitle);
            $price = Pricing::find()
                ->where(['plan_id' => $plan->id])
                ->andWhere(['duration' => $model->duration])
                ->one();

SELECT * FROM `countries` WHERE `code`='AG'
---
    protected function getCountryName($countryCode)
    {
        $country = Countries::findOne(['code' => $countryCode]);

SELECT * FROM `policy_draft` WHERE `id`='47'
---
    public function actionPassengers($draft, $passengers = null)
    {

        // dd($draft);
        $policy = PolicyDraft::findOne($draft);

SELECT * FROM `policy_draft` WHERE `id`='34'
SELECT * FROM `policy_draft_passengers` WHERE `draft_id`='34'
---
        public function actionPayment($id)
    {
        $policyDraft = PolicyDraft::findOne($id);
        $passenger = PolicyDraftPassengers::find()->where(['draft_id' => $id])->one();

SELECT * FROM `customers` WHERE `mobile`='+962790751376'
---
                // dd( $apiResponseData);
                if (isset($apiResponseData['id']) && !empty($apiResponseData['id'])) {

                    $customer = Customers::findOne(['mobile' => $policyDraft->mobile]);

INSERT INTO `policy` (`customer_id`, `source`, `from_airport`, `DepartCountryCode`, `departure_date`, `going_to`, `ArrivalCountryCode`, `return_date`, `price`, `ProposalState`, `ItineraryID`, `PNR`, `PolicyNo`, `PolicyPurchasedDateTime`, `PolicyURLLink`, `status`, `status_description`, `created_at`, `updated_at`) VALUES (2, 0, 'ANU', 'AG', '2024-08-07', 'AXA', 'AI', '2024-08-13', '1.00', 'Proposal State', 'fd989a71-e2e9-409f-ac04-1c86a908ea72', '', '', '2024-08-05 16:57:34', '', 0, 'Status Description', 1722869854, 1722869854)
---
                    $policy->status = $response['status'] ?? 0;
                    $policy->status_description = $response['status_description'] ?? 'Status Description';

                    if ($policy->save()) {