yii/frontend/controllers/InsuranceController.php

SELECT * FROM `pricing` WHERE (`plan_id`='6') AND (`duration`='7')
---
    public function actionTravel()
    {
        $model = new InquiryForm();
        $model->setAttributes(\Yii::$app->request->get('InquiryForm'));

        $fromCountryName = $this->getCountryName($model->from_country);
        $toCountryName = $this->getCountryName($model->to_country);
        // dd($model);
        if ($model->load(Yii::$app->request->post())) {

            $passengers = $model->adult + $model->children;
            $price = Pricing::find()
                ->where(['plan_id' => $model->plan])
                ->andWhere(['duration' => $model->duration])
                ->one();

SELECT `plans`.* FROM `plans` LEFT JOIN `pricing` ON `plans`.`id` = `pricing`.`plan_id` WHERE (`plans`.`insurance_id`='1') AND (`pricing`.`duration`='7') AND ((`pricing`.`passenger`='adult') OR (`pricing`.`passenger` IS NULL) OR ((`pricing`.`passenger`='adult') AND (`pricing`.`passenger` IS NULL)))
---
        }

        // dd( $childrenPassenger );
        $plans = Plans::find()
            ->joinWith('pricings')
            ->where(['plans.insurance_id' => $model->type])
            ->andWhere(['pricing.duration' => $model->duration])
            ->andWhere([
                'or',
                ['pricing.passenger' => $adultPassenger],
                ['pricing.passenger' => $childrenPassenger],
                [
                    'and',
                    ['pricing.passenger' => $adultPassenger],
                    ['pricing.passenger' => $childrenPassenger]
                ]
            ])
            ->all();

SELECT * FROM `insurance_countries` WHERE (`insurance_id`='1') AND (`country_code`='AI')
---
        //     }
        // }

        $insuranceCountry = InsuranceCountries::find()
            ->where(['insurance_id' => $model->type])
            ->andWhere(['country_code' => $model->from_country])
            ->one();

SELECT * FROM `pricing` WHERE (`plan_id`=1) AND (`duration`='7')
---
        foreach ($plans as $plan) {
            $insuranceTitle = $plan->insurance->name;

            $price = Pricing::find()
                ->where(['plan_id' => $plan->id])
                ->andWhere(['duration' => $model->duration])
                ->one();

SELECT * FROM `countries` WHERE `code`='AZ'
---
    protected function getCountryName($countryCode)
    {
        $country = Countries::findOne(['code' => $countryCode]);

SELECT * FROM `policy_draft` WHERE `id`='30'
---
    public function actionReview($draft)
    {
        $policy = PolicyDraft::findOne($draft);

SELECT * FROM `insurance_countries` WHERE `slug` IS NULL
SELECT * FROM `insurances`
---
    public function actionType($slug = null)
    {
        $country = InsuranceCountries::findOne(['slug' => $slug]);
        $model = new InquiryForm();

        $sourceCountry = $country ? $country->country_code : null;

        // $insurances = $country ? \common\models\Insurances::find()
        //     ->joinWith('insuranceCountries')
        //     ->where(['source_country' => $country->source_country])
        //     ->all() : [];

        $insurances = $country
            ? \common\models\Insurances::find()->joinWith('insuranceCountries')->where(['source_country' => $country->source_country])->all()
            : \common\models\Insurances::find()->all();