yii/frontend/controllers/SiteController.php

SELECT * FROM `insurance_countries` WHERE `slug`='jordan'
SELECT `insurances`.* FROM `insurances` LEFT JOIN `insurance_countries` ON `insurances`.`id` = `insurance_countries`.`insurance_id` WHERE `source_country`='Jordan'
SELECT * FROM `insurances`
---
    public function actionIndex($slug = null)
    {
        $country = InsuranceCountries::findOne(['slug' => $slug]);
        $model = new InquiryForm();

        $sourceCountry = $country ? $country->country_code : null;

        // $insurances = $country ? \common\models\Insurances::find()
        //     ->joinWith('insuranceCountries')
        //     ->where(['source_country' => $country->source_country])
        //     ->all() : [];

        $insurances = $country
            ? \common\models\Insurances::find()->joinWith('insuranceCountries')->where(['source_country' => $country->source_country])->all()
            : \common\models\Insurances::find()->all();