yii/backend/views/Airport/_form.php

    <?= $form->field($model, 'cityName', ['options' => ['class' => 'col-sm-6']])->textInput(['maxlength' => true]) ?>


    <?= $form->field($model, 'country_id', ['options' => ['class' => 'col-sm-6']])->dropDownList(
        \yii\helpers\ArrayHelper::map(
            \common\models\Countries::find()->all(),
            'id',
            'country'
        ),
        ['class' => 'form-select']
    ) ?>
---
SELECT * FROM `countries`