yii/frontend/views/layouts/main.php

SELECT * FROM `insurances`
---
                                <a class="nav-link dropdown-toggle" href="#" role="button" data-bs-toggle="dropdown" aria-expanded="false">Insurances</a>
                                <ul class="dropdown-menu">

                                    <?php foreach (\common\models\Insurances::find()->all() as $insurance) : ?>

SELECT * FROM `insurances` LIMIT 6
---
                                </div>
                                <div class="collapse d-lg-block" id="collapseLanding" data-bs-parent="#ft-links">
                                    <ul class="list-unstyled mb-0 py-3 py-lg-0">
                                        <?php foreach (\common\models\Insurances::find()->limit(6)->all() as $insurance) : ?>

SELECT DISTINCT `source_country`, `slug` FROM `insurance_countries` LIMIT 5
---
                                <ul class="list-unstyled mb-0 py-3 py-lg-0">

                                <?php
                                    $countries = \common\models\InsuranceCountries::find()
                                        ->select(['source_country', 'slug'])
                                        ->distinct()->limit(5)
                                        ->all();