yii/backend/controllers/InsuranceCountryController.php

SELECT * FROM `insurance_countries` WHERE `id`='2'
---
    protected function findModel($id)
    {
        if (($model = InsuranceCountries::findOne(['id' => $id])) !== null) {