yii/backend/controllers/InsuranceController.php

SELECT * FROM `insurances` WHERE `id`='1'
---
    protected function findModel($id)
    {
        if (($model = Insurances::findOne(['id' => $id])) !== null) {