yii/backend/controllers/PricingController.php

SELECT * FROM `pricing` WHERE `id`='1'
---
    protected function findModel($id)
    {
        if (($model = Pricing::findOne(['id' => $id])) !== null) {