yii/common/models/CountriesSearch.php

SELECT COUNT(*) FROM `countries`
---
    public function search($params)
    {
        $query = Countries::find();

        $this->load($params);

        if (!$this->validate()) {
            // If validation fails, return a data provider with no records
            $query->where('0=1');
            return new ActiveDataProvider([
                'query' => $query,
                'pagination' => [
                    'pageSize' => 10,
                ],
            ]);
        }


        $query->andFilterWhere([
            'id' => $this->id,
            'callCode' => $this->callCode,
            'active' => $this->active,
        ]);

        $query->andFilterWhere(['like', 'code', $this->code])
            ->andFilterWhere(['like', 'country', $this->country])
            ->andFilterWhere(['like', 'zone', $this->zone])
            ->andFilterWhere(['like', 'currency', $this->currency]);


        $totalCount = $query->count();