yii/common/models/InsuranceCountriesSearch.php

    public function search($params)
    {
        $query = InsuranceCountries::find();

        // add conditions that should always apply here
        $query->joinWith(['insurance']);
        $dataProvider = new ActiveDataProvider([
            'query' => $query,
        ]);
        $dataProvider->sort->attributes['insurance_name'] = [
            'asc' => ['insurances.name' => SORT_ASC],
            'desc' => ['insurances.name' => SORT_DESC],
        ];

        $this->load($params);

        if (!$this->validate()) {
            // uncomment the following line if you do not want to return any records when validation fails
            // $query->where('0=1');
            return $dataProvider;
        }

        $query->andFilterWhere([
            'id' => $this->id,
            'insurances.name' => $this->insurance_name,
        ]);

        $query->andFilterWhere(['like', 'country_code', $this->country_code])
            ->andFilterWhere(['like', 'company_name', $this->company_name])
            ->andFilterWhere(['like', 'company_logo', $this->company_logo])
            ->andFilterWhere(['like', 'source_country', $this->source_country])
            ->andFilterWhere(['like', 'source_country_code', $this->source_country_code]);
---
SELECT COUNT(*) FROM `insurance_countries` LEFT JOIN `insurances` ON `insurance_countries`.`insurance_id` = `insurances`.`id`