yii/common/models/PlansItemsSearch.php

    public function search($params)
    {
        $query = PlansItems::find();

        // Join with the Plans table
        // $query->joinWith(['plan']);

        $totalCount = $query->count();
---
SELECT COUNT(*) FROM `plans_items`