yii/frontend/views/insurance/index.php

SELECT * FROM `plans` WHERE `insurance_id`='1'
---
                                <th scope="col">
                                    <div class="fs-5 text-dark fw-semibold">Plans</div>
                                </th>
                                <?php foreach (\common\models\Plans::find()->where(['insurance_id' => $model->type])->all() as $plan) : ?>

SELECT * FROM `plans_items` WHERE `insurance_id`='1'
---
                            </tr>
                        </thead>
                        <tbody>
                            <?php foreach (\common\models\PlansItems::find()->where(['insurance_id' => $model->type])->all() as $planitem) : ?>