yii/frontend/views/insurance/index.php


                                        <td>
                                            <?php
                                            $planCoverage = \common\models\PlansCoverage::find()->where(['item_id' => $planitem->id, 'plan_id' => $plan->id])->one();
---
SELECT * FROM `plans_coverage` WHERE (`item_id`=1) AND (`plan_id`=2)