yii/frontend/views/insurance/index.php

SELECT * FROM `plans_items` WHERE `insurance_id`='1'
---
                            </tr>
                        </thead>
                        <tbody>
                            <?php foreach (\common\models\PlansItems::find()->where(['insurance_id' => $model->type])->all() as $planitem) : ?>

SELECT * FROM `plans_coverage` WHERE (`item_id`=1) AND (`plan_id`=1)
---
                                    <?php foreach (\common\models\Plans::find()->where(['insurance_id' => $model->type])->all() as $plan) : ?>
                                        <td>
                                            <?php
                                            $planCoverage = \common\models\PlansCoverage::find()->where(['item_id' => $planitem->id, 'plan_id' => $plan->id])->one();