yii/frontend/views/insurance/passengers.php

                            <div class="card-body">
                                <?php $form = ActiveForm::begin(['options' => ['enctype' => 'multipart/form-data', 'class' => 'row needs-validation g-3']]) ?>
                                <div class="col-md-6">
                                    <?= $form->field($policy, 'from_airport')->dropDownList(
                                        \yii\helpers\ArrayHelper::map(
                                            \common\models\Airports::find()
                                                ->leftJoin('countries', 'countries.code = airports.countryCode')->where(['countries.code' => $policy->DepartCountryCode])
                                                ->all(),
                                            'code',
                                            'name'
                                        )
                                    ) ?>
                                </div>
                                <div class="col-md-6">
                                    <?= $form->field($policy, 'going_to')->dropDownList(
                                        \yii\helpers\ArrayHelper::map(
                                            \common\models\Airports::find()
                                                ->leftJoin('countries', 'countries.code = airports.countryCode')
                                                ->where(['countries.code' => $policy->ArrivalCountryCode])
                                                ->all(),
                                            'code',
                                            'name'
                                        )
                                    ) ?>
---
SELECT `airports`.* FROM `airports` LEFT JOIN `countries` ON countries.code = airports.countryCode WHERE `countries`.`code`='AG'
SELECT `airports`.* FROM `airports` LEFT JOIN `countries` ON countries.code = airports.countryCode WHERE `countries`.`code`='AO'